{"subject":{"value":"History of Art","type":"string"},"totalUsers":{"value":0,"type":"number"},"highScore":{"value":0,"type":"number"},"prep":{"value":"<p>Visit this online catalogue of previous exhibitions and read . . . </br> (1) the description of the painting – </br> <a href=\"http://www.liverpoolmuseums.org.uk/walker/exhibitions/henry/whitehall.aspx\" target=\"_blank\">http://www.liverpoolmuseums.org.uk/walker/exhibitions/henry/whitehall.aspx</a> </br> (2) the description of the court – </br> <a href=\"http://www.liverpoolmuseums.org.uk/walker/exhibitions/henry/court.aspx\" target=\"_blank\">http://www.liverpoolmuseums.org.uk/walker/exhibitions/henry/court.aspx</a> </br> </p>  <p>View this short National Theatre clip about the technique of transfer from drawing called ‘pouncing’:</br> <a href=\"https://www.youtube.com/watch?v=2v_QTfd8ZIk\" target=\"_blank\">https://www.youtube.com/watch?v=2v_QTfd8ZIk</a> </p>","type":"string"},"avgScore":{"value":0,"type":"number"},"creator":{"value":"Adam Rattray","type":"string"},"type":{"value":2,"type":"number"},"title":{"value":"‘The Whitehall Mural’ - Power and authority in Tudor royal portraits","type":"string"},"pallet":{"value":{"_referencePath":{"segments":["pallets","demopallet"],"projectId":"learning-fortress","databaseId":"(default)"}},"type":"documentReference"},"summary":{"value":" <p> <ul> <li>The Whitehall Mural, Hans Holbein (The Younger), 1537, Buon Fresco, 2.7m x 3.6m, Whitehall Palace.</li> <li>Destroyed by fire in 1698.</li> <li>Copy by Remigius van Leemput, 1667, oil on canvas, 0.88m x 0.98m, Hampton Court Palace, painted for King Charles II of England.</li> </ul> </p> <p> In 1537, when this fresco was painted, Henry VIII was far from being the man he wished others to see. The past was a series of expensive, inglorious military adventures; the present was a battle for survival. </p> <p> The previous eighteen months had been especially difficult. In the autumn of 1535, thousands of his own subjects had risen throughout Northern England in protest at heavy taxation and religious reform. (Henry had cut England off from Catholic Christendom, named himself head of the English Church and begun to shut monasteries and seize their lands.) In January 1536, a bad jousting accident had nearly killed him; in July, Henry Fitzroy, his illegitimate son and favourite, had died of consumption.  </p> <p> Now 45, the king was very different to the muscular, athletic youth who had revelled in tiltyard sports. He was becoming fat and unwieldy – a semi-invalid. Thrombosed legs caused him increasing pain: they were not dressed in the fine silk stockings of Holbein’s image but bandaged to cover suppurating open sores.</p> <p> Henry knew his future was probably short (he had ten years to live) and that he might be the last of the Tudors: after twenty-eight years of married life, none of his first three wives had yet given him the legitimate male heir he needed. And while the future Edward VI would be born in October (Jane Seymour’s hands are tellingly clasped above her belly), the Queen herself would die of post-natal complications.</p> <p> The mural was painted for Henry's grand new headquarters, the Palace of Whitehall, ‘inherited’ from the disgraced Cardinal Wolsey. No documentation survives concerning the commission, but it reflects an obsession with validating his legitimacy and legacy as a Tudor. Had Henry’s position been more certain and secure, this fresco would probably never have been commissioned: it is a means to an end – art created as dynastic propaganda. </p> <p> Covering ten square metres, the large mural dominated the relatively small privy chamber in which it was located. Only the most powerful and important people were admitted into Henry’s privy chamber: confronting the mural as they entered was calculated to put them in their place.</p> <p> Holbein the Younger’s technique and skill had brought an unprecedented level of naturalistic representation to German portraiture, capturing the attention of political and intellectual elites – including Sir Thomas More (Lord Chancellor under Henry VIII, 1529 – 1532), who had seen Holbein’s portrait of Erasmus, the Dutch scholar. More was so impressed that he summoned Holbein to England to have his own portrait painted, thereby introducing the German master into Henry’s court. </p> <p> The king’s self-aggrandising ambition demanded nothing less than a masterpiece by one of Europe’s most accomplished and acclaimed artists. It seems highly likely, moreover, that Henry collaborated on Holbein’s composition and central conceit: X-ray and infrared scans reveal that in Holbein's original design Henry appeared three-quarter face. The deliberate change to the full-frontal, defiant stance which emphasises his authority was most probably at the king&#39;s instigation, as would have been the padding-out of Henry’s shoulders and neck, which obliged the artist to lengthen the royal legs in keeping with scale and perspective. The king has been idealised, but without Holbein’s virtuosic naturalism, the image might have verged on caricature. Instead, it exudes and exalts Henry’s authority: in opulence of detail, in clarity of composition and in sheer scale. Without recourse to crown and sceptre or the weapons of war, the portrait declares that here is a warrior king who stands defiant in the face of all opposition. The ostentatious profusion of jewels and fine fabrics conveys his inexhaustible material wealth, while the thrusting codpiece proclaims his virility and implies the future security of the Tudor dynasty. </p> <p> So striking and authoritative is Holbein’s depiction of the larger-than-life king that, though destroyed more than three hundred years ago, it has become the definitive image of Henry in the collective public consciousness. </p>","type":"string"},"brief":{"value":"To explore the symbolism and significance of the mural as a work of propaganda and as a reflection of Henry VIII’s religious, political and personal outlook.","type":"string"}}