{"type":{"value":1,"type":"number"},"summary":{"value":"<p>Primary alcohols can be oxidised to form aldehydes and carboxylic acids whilst secondary alcohols can be oxidised to form ketones. Whether an aldehyde or carboxylic acid is formed from a primary alcohol depends on the conditions used. Oxidation of alcohols is typically carried out using a mixture of an oxidising agent such as potassium dichromate (VI) and dilute sulfuric acid. The oxidising agent turns from orange to green when oxidation occurs.</p> <p>The oxidation of ethanol to the aldehyde ethanal is represented by the equation below, where [O] is used to represent the oxidising agent:</p> <img src=\"https://s3.eu-west-2.amazonaws.com/scholar6/bricks/chemistry/synthesis1.png\" width=\"100%\" />  <p>Aldehydes are further oxidised to carboxylic acids and so adding small quantities of the oxidising agent and carrying out the oxidation using distillation apparatus reduces the likelihood of the aldehyde being further oxidised to a carboxylic acid. Heating the mixture under reflux encourages the formation of the carboxylic acid.</p> <p>The equation for the oxidation of ethanal to the carboxylic acid ethanoic acid is:</p> <img src=\"https://s3.eu-west-2.amazonaws.com/scholar6/bricks/chemistry/synthesis2.png\" width=\"100%\" /> <p>Secondary alcohols are oxidised to ketones. Ketones contain a C=O bond and the C is bonded to two other carbon atoms. The structure of the ketone butanone is shown below:</p> <img src=\"https://s3.eu-west-2.amazonaws.com/scholar6/bricks/chemistry/synthesis3.png\" width=\"100%\" /> <p>The apparatus used to maximise the yield of aldehyde formed during oxidation is shown below:</p> <img src=\"https://s3.eu-west-2.amazonaws.com/scholar6/bricks/chemistry/synthesis4.png\" width=\"100%\" /> <p>Carboxylic acids are formed by the reaction between primary alcohols and oxidising agents when the mixture is heated under reflux. The apparatus shown below is used to reflux a mixture.</p> <img src=\"https://s3.eu-west-2.amazonaws.com/scholar6/bricks/chemistry/synthesis4.png\" width=\"100%\" />","type":"string"},"pallet":{"value":{"_referencePath":{"segments":["pallets","demopallet"],"projectId":"learning-fortress","databaseId":"(default)"}},"type":"documentReference"},"totalUsers":{"value":0,"type":"number"},"highScore":{"value":0,"type":"number"},"prep":{"value":"<p>View this short film on the use of ethanol as a biofuel and how its oxidation/combustion is used to fuel cars.</p> <p style=\"text-align:center;\"><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/bHv8grMXjyc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>","type":"string"},"creator":{"value":"Dan Evans","type":"string"},"avgScore":{"value":0,"type":"number"},"brief":{"value":"To introduce the chemistry and practical techniques associated with the oxidation of alcohols","type":"string"},"title":{"value":"Alcohol Fuelled Cars – The Oxidation of Alcohols","type":"string"},"subject":{"value":"Chemistry","type":"string"},"creationDate":{"value":"2018-11-09T10:00:00.000Z","type":"timestamp"}}