{"prep":{"value":"<p><b>Read the Latin text of the poem:</b></br></p> <p>gavisa es certe sublatam Cynthia legem,</br> &nbsp;&nbsp;&nbsp;&nbsp;qua quondam edicta flemus uterque diu,</br> ni nos divideret; quamvis diducere amantis</br> &nbsp;&nbsp;&nbsp;&nbsp;non queat invitos Iuppiter ipse duos.</br> &#39;at magnus Caesar.&#39; sed magnus Caesar in armis:</br> &nbsp;&nbsp;&nbsp;&nbsp;devictae gentes nil in amore valent.</br> nos uxor numquam, numquam diducet amica:</br> &nbsp;&nbsp;&nbsp;&nbsp;semper amica mihi, semper et uxor eris.</br> nam citius paterer caput hoc discedere collo</br> &nbsp;&nbsp;&nbsp;&nbsp;quam possem nuptae perdere more faces,</br> aut ego transirem tua limina clausa maritus,</br> &nbsp;&nbsp;&nbsp;&nbsp;respiciens udis prodita luminibus.</br> a mea tum qualis caneret tibi tibia somnos,</br> &nbsp;&nbsp;&nbsp;&nbsp;tibia, funesta tristior illa tuba!</br> unde mihi patriis natos praebere triumphis?</br> &nbsp;&nbsp;&nbsp;&nbsp;nullus de nostro sanguine miles erit.</br> quod si vera meae comitarem castra puellae,</br> &nbsp;&nbsp;&nbsp;&nbsp;non mihi sat magnus Castoris iret equus.</br> hinc etenim tantum meruit mea gloria nomen,</br> &nbsp;&nbsp;&nbsp;&nbsp;gloria ad hibernos lata Borysthenidas.</br> tu mihi sola places: placeam tibi, Cynthia, solus:</br> &nbsp;&nbsp;&nbsp;&nbsp;hic erit et patrio nomine pluris amor.</br></p>  <p><b>A translation of the poem can be found here:</b></br></p> <p>You must certainly have rejoiced, Cynthia, at the cancellation of the law</br> whose publication we both once wept about for a long time,</br> unless it might divide us; though Jupiter himself cannot</br> part two lovers who are unwilling.</br> ‘But great is Caesar.’ But Caesar is great in arms:</br> conquered nations mean nothing in love.</br> A wife, a girlfriend will never never divide us:</br> you will always be my girlfriend, and always my wife.</br> For I would sooner allow my head to leave this neck</br> than I could waste torches at the request of a bride,</br> or cross your closed threshhold as a married man,</br> looking back at the betrayed [threshhold] with wet eyes.</br> Ah! Then what sort of sleep would my flute sing for you,</br> the flute, sadder than the funereal trumpet!</br> How should I provide sons for the triumphs of the fatherland?</br> There will be no soldier from my blood.</br> But if I were following the real camp, that of my girl,</br> the magnificent horse of Castor would not be enough for me.</br> For my glory has deserved such a great name from this,</br> a glory conveyed to the wintry northern lands.</br> You alone please me; may I be the only one to please you, Cynthia:</br> This love will be worth more than the name of father.</br></p>","type":"string"},"avgScore":{"value":0,"type":"number"},"creator":{"value":"Neil Croally","type":"string"},"type":{"value":1,"type":"number"},"title":{"value":"Propertius 2.7","type":"string"},"pallet":{"value":{"_referencePath":{"segments":["pallets","demopallet"],"projectId":"learning-fortress","databaseId":"(default)"}},"type":"documentReference"},"summary":{"value":"<p>Propertius, with Tibullus and Ovid, was one of the love elegists writing during the Augustan era (c. 31BC onwards). Love Elegy, while influenced by Greek lyric poets such as Sappho and by Catullus (writing in the 50s BC), is a distinctively Roman poetic genre. Elegies are written in a meter called elegiac couplet, where a hexameter line is followed by a pentameter. All the elegists address a proportion of their poems to a lover: Cynthia for Propertius, Delia for Tibullus, Corinna for Ovid. (There is no need to think that any of the poets was describing a real affair.)</p> <p>Propertius 2.7 – at least in its first half – seems something of an oddity. While there is some reference to the poet’s feelings, and to the way he sees the relationship with Cynthia, the real interest of these opening lines is the cancelled law mentioned in line 1. Most commentators agree that it had something to do with Augustus’ preoccupation with discouraging adultery. A few years later, in 18BC, he did succeed in passing brutal moral legislation (the Lex Iulia) which exposed women found guilty of adultery to banishment and loss of dowry, or even execution by their husband or father. By viewing the poem generally in terms of Roman society, and even more specifically in relation to Augustus himself, it is possible to see its stance as defiantly anti-Augustan. Yet Propertius was patronized by Maecenas, one of Augustus’ closest confidants, so it is startling to find him defending individual freedom and depicting the regime as repressive, intrusive and, ultimately, in lines 5-6, impotent against the power of love.</p> <p>The poem also exhibits several more typical features of love elegy. The poem is addressed to his lover, and Propertius casts the affair in extreme terms: the lovers do not wish to be parted (line 3); not even Jupiter can divide them (lines 3-4); Cynthia will always be Propertius’ lover and wife (line 8); the betrayal of marriage is imagined (line 12); a mythical figure is referred to (line 18); exotic places are mentioned (line 20). Most obviously, though, Propertius makes use of the common convention of the militia amoris (the campaign of love). He may dismiss Caesar’s power as limited to the military sphere (lines 5- 6), but he seems to be saying that the only sort of soldier he can be is one who campaigns for love (lines 17-20).</p>","type":"string"},"brief":{"value":"Historical and political context can be important in interpreting a poem: even a self-consciously literary form like love elegy can respond to current affairs. Propertius 2.7 confronts the Emperor Augustus’ proposed legislation against adultery.","type":"string"},"subject":{"value":"Latin","type":"string"},"totalUsers":{"value":0,"type":"number"},"highScore":{"value":0,"type":"number"}}